app/Http/Livewire/NoteList.php

    public function render()
    {
        $notes = Note::with('user')->latest()->paginate(2);
---
select * from `notes` order by `created_at` desc limit 2 offset 0
select * from `users` where `users`.`id` in (1)
select count(*) as aggregate from `notes`